void help()
{
	printf("\n*****************************************************************************\n");
	printf("命令格式：\n");
	printf("0.初始化---------------init\n");
	printf("1.显示系统信息---------info\n");
	printf("2.改变目录-------------cd + 空格 + 路径\n");
	printf("3.显示目录-------------dir + 空格 + 路径\n");
	printf("4.创建目录-------------md + 空格 + 路径(包含目录名)\n");
	printf("5.删除目录-------------rd + 空格 + 路径(包含目录名)\n");
	printf("6.建立文件-------------newfile + 空格 + 路径(包含文件名)\n");
	printf("7.打开文件-------------cat + 空格 + 路径(包含文件名)\n");
	printf("8.拷贝文件-------------copy + 空格 + 源路径 + 空格 + 目标路径\n");
	printf("9.删除文件-------------del + 空格 +路径(包含文件名)\n"); 
	printf("10.检测并恢复文件系统--check\n");
	printf("11.退出文件模拟--------exit\n");
	printf("12.帮助----------------help\n");
	printf("注意：\n");
	printf("1.路径支持绝对路径和相对路径,当前目录为 . 上一级目录为 .. \n");
	printf("2.路径间用 / 隔开\n");
	printf("3.当与host文件系统间进行文件拷贝时路径名前应加<host>,且路径间用\\隔开\n");
	printf("*****************************************************************************\n\n");
}